test-results/2025-12-21/monolith/soak-stress/summary.txt
     █ login-Pemohon

       ✓ signin status is 200
       ✓ signin success flag

       █ pemohon-flow

         ✓ create permohonan 201
         ✓ submit permohonan ok

     █ login-Pimpinan

       ✓ signin status is 200
       ✓ signin success flag

       █ pimpinan-flow

     █ login-OPD

       ✓ signin status is 200
       ✓ signin success flag

       █ opd-flow

     █ login-Admin

       ✓ signin status is 200
       ✓ signin success flag

       █ admin-flow

         ✓ list permohonan 200
         ✓ approve 200
         ✓ disposisi status 201

   ✓ auth_latency...................: avg=262.2ms  min=56.44ms  p(50)=210.62ms p(90)=499.12ms p(95)=599.11ms p(99)=825.86ms max=5.23s  
     checks.........................: 100.00% ✓ 124660    ✗ 0     
     data_received..................: 92 MB   26 kB/s
     data_sent......................: 52 MB   14 kB/s
     group_duration.................: avg=7.1s     min=503.9µs  p(50)=7.66s    p(90)=10.17s   p(95)=10.71s   p(99)=11.66s   max=16.78s 
     http_req_blocked...............: avg=2.99µs   min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=9.91ms 
     http_req_connecting............: avg=498ns    min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=9.91ms 
   ✓ http_req_duration..............: avg=636.73ms min=502.7µs  p(50)=543.24ms p(90)=1.49s    p(95)=1.72s    p(99)=2.12s    max=6.71s  
       { expected_response:true }...: avg=636.73ms min=502.7µs  p(50)=543.24ms p(90)=1.49s    p(95)=1.72s    p(99)=2.12s    max=6.71s  
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 146066
     http_req_receiving.............: avg=55.83µs  min=0s       p(50)=0s       p(90)=0s       p(95)=519.4µs  p(99)=551.2µs  max=90.82ms
     http_req_sending...............: avg=12.57µs  min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=516.29µs max=21.17ms
     http_req_tls_handshaking.......: avg=0s       min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=0s     
     http_req_waiting...............: avg=636.66ms min=502.7µs  p(50)=543.18ms p(90)=1.49s    p(95)=1.72s    p(99)=2.12s    max=6.71s  
     http_reqs......................: 146066  40.466803/s
     iteration_duration.............: avg=8.23s    min=1.09s    p(50)=9s       p(90)=10.71s   p(95)=11.14s   p(99)=11.99s   max=16.78s 
     iterations.....................: 32814   9.090943/s
   ✓ permohonan_latency.............: avg=1.08s    min=502.7µs  p(50)=983.47ms p(90)=1.81s    p(95)=1.98s    p(99)=2.37s    max=6.71s  
   ✓ survey_latency.................: avg=655.74ms min=180.59ms p(50)=632.91ms p(90)=873.08ms p(95)=963.76ms p(99)=1.21s    max=4.83s  
     vus............................: 2       min=2       max=75  
     vus_max........................: 75      min=75      max=75  
   ✓ workflow_latency...............: avg=654.32ms min=503.9µs  p(50)=687.61ms p(90)=1.1s     p(95)=1.26s    p(99)=1.6s     max=6.18s